"""
被投行摧残了接近两年,最近入职了微软,为了大米来聊聊入职以后的感受

入职之前听说微软是养老公司, 之前有个大表哥来了以后说每天没事干, 干啥都没动力. 哎，这不就是我的梦想吗, 拿钱不用干活,带薪刷题. 打进来以后发现原来是看组的.
微软社招流程和大部分公司一样, 面试的时候的组基本上就是入职以后的组, 笔者入职的是Identity.

3月末入的职, 入职的下一周微软就把NEO(new employee orientation)换成了virtual. 全副武装从纽约飞到了西雅图.
入职以后老板会安排一个onboarding buddy. 第一周去了办公室2-3次把电脑set up, 第二周就和老朋友们线上多人运动, 刷题.
毕竟是养老公司, 肯定没多少活啊. 不想，第2周开始就安排活了.

老板把Micro management发挥到了极致, 1on1的时候会问每天做了什么, 精确到小时. 第三周已经接到4个tasks, 组里都是来了不到1年的没有懂, 要自己搞懂，加上doc不全，基本每天要干12小时才能不被老板说.
做事满了老板会直接批评, 像极了小学老师. 不过还在全组人都这样, 我不是孤单一人. 正在我纠结为啥工作强度这么大, 做的东西如此无聊的，大伙还能坚持的时候, 组里小哥传来消息, 换组了.
这个组加我和老板一共7个人, 我和一个NG印度小伙是新来的, 小黑哥8个月, 其他三个华人分别是4, 10, 12个月. 老板2年.

小黑哥走了之前, 我们聊了许久, 说到底小哥受不了老板打压了, 总的来看小哥一人之力建了组里所有spark job， scala贼溜, C#也能写, 每天12小时, 来了8个月业务娴熟, 结果review是一般.
抱着升职梦想惨遭如此命运, 小哥毅然决然的走了, 伤自尊了. 此时, 新来的NG的印度小哥也来问, 怎么换组, 虽然小哥自己和老板都是印度人, 身为abi的小哥时而听不懂老板说话.
最终就在小黑哥走之前的一周, 传来了惊天喜讯, 老板被炒了！ 原来这个组一年前的5个员工不是现在这批， 小黑哥一走turn over rate就是100%. 一年员工全跑了导致老板被炒.
但我当时已经开始面其他组了, 面着面着发现好组那么多, 我为啥要在一个Ops比写代码多的组耗着, 2周面了40多个组以后，从6个愿意要我的组里选了个忙但能学到东西的, 属于Azure核心组之一.

走了以后还是和小黑哥和小印哥保持联系, 没跳出来的还在骚动, 跳出来的有恃无恐. 7月入职的新组, 这个组负责distributed system底层， 就是传说中DDIA的第三章讲的东西, replication, cluster,
parition, LSM/B Tree. 这个组都能遇到, 组里华人印度人2:8。 每个人都是超级好. 第3天就接到第一个task, 老板解释task简洁明了, entry point, 我们想干啥, XX不会找OO,
每个人都有对应的项目, 基本不会遇到给个task全组没人懂的问题. 组里用的是C++，身为python也不会太吃力. 不过刚入职还是每天10几小时, 但不会有找不到方向的焦虑, 一个月学到的东西比前一个组3个月学得多, 还有用, 组员人还好, 哎.
也许有一天笔者水平能够handle前组老板的压力, 但何必呢, 多看看几个组说不定能找到真爱



这个组老板安排的活基本都是和Ops相关的, 基本上都是set up一些package， environment etc. 但是组里没有一个老同志, 都是来了不到一年的, 所以基本上都是靠自己.
前三周笔者都没当回事, 第四周就坏菜了. 老板要求做事效率是按熟手来的, 比如set up env要联系很多组去找出谁能帮忙, 但老板觉得30分钟就能搞定, 就算等, 中间也应该做别的事.
New hire每周都要给老板weekly report. 每周1on1的时候老板会问上周做了什么, 精确到小时. 所以摸鱼在这个组是做不到的.

第二个月放弃刷题, 保住工作先，每天基本12小时才能保证不被老板说, 基本每次谈话都会说我进度比较慢, 当时压力是比较大的. 好在组员还不错, 虽然都是新手, 但还是有两个来了接近1年的.
和组员聊的都还不错, 聊着聊着发现其他人也有这方面压力, 基本每个组员都要每天至少干12小时. 但基本也没人赶公开说什么.

第三个月和组里黑人小哥聊spark, 小哥人很聪明, 组里的big data job都是他一个人弄的, 我就问小哥， 你这skill为啥在这个组, 小哥说


"""



#
#
# def solution(parentheses, index):
#     # Type your solution here
#     stack = []
#     for i in range(index, len(parentheses)):
#         if parentheses[i] == "(":
#             stack.append((parentheses[i], i))
#         else:
#             if not stack:
#                 return -1
#             stack.pop()
#             if not stack:
#                 return i
#
# parentheses = "((()())())"
# index = 2
# print(solution(parentheses, index))
#
#





